# frozen_string_literal: true

# Run this file with `brew bundle`

brew 'atuin' # store shell history in SQLite
brew 'automake'
brew 'bat' # cat replacement
brew 'chafa' # image and ASCII art viewer
brew 'choose-rust' # sed replacement. e.g.: `bat things.csv | choose 5`
brew 'cmake'
brew 'coreutils' # gnu coreutils
brew 'datasette' # simple web interface to SQLite databases
brew 'dua-cli' # display disk usage, & delete unwanted data
brew 'eza' # git-aware ls replacement
brew 'fd' # file finder
brew 'fzf' # fuzzy finder
brew 'gh' # GitHub CLI
brew 'git' # git, you stupid git
brew 'git-delta' # git-diff replacement
brew 'git-lfs' # handle Large Files in git
brew 'glow' # markdown reader
brew 'gpg' # pretty good
brew 'gping' # ping, but with graphs
brew 'grep' # gnu grep
brew 'httpie' # cURL replacement. e.g.: `http POST pie.dev/post hello=world`
brew 'imagemagick'
brew 'jq' # json processor
brew 'lazygit' # git TUI

# https://github.com/ggerganov/llama.cpp
#    llama-cli --hf-repo ggml-org/Qwen2.5-Coder-7B-Q8_0-GGUF \
#      --hf-file qwen2.5-coder-7b-q8_0.gguf -p "The meaning to life and the universe is"
brew 'llama.cpp' # LLM inference in C/C++. Used by llama.vim plugin

brew 'mas' # CLI for Mac App Store
brew 'mise' # Version manager for Ruby, Node, etc.
brew 'npm' # node package manager
brew 'make' # gnu make
brew 'memcached'
brew 'parallel' # gnu parallel
brew 'redis' # redis is redis
brew 'rg' # ripgrep
brew 'sd' # easy search & replace. sed alternative/replacement
brew 'sl' # 🚂
brew 'showkey' # type a key and see it echoed in the terminal
brew 'solargraph' # Ruby language server (LSP)
brew 'starship' # robust shell prompt
brew 'tealdeer' # Rust impl of `tldr`: man page supplement. brief desc, then examples
brew 'tig' # git history viewer
brew 'toilet' # ascii banners :)
brew 'uv' # extremely fast Python package installer
brew 'watchman' # watches files/dirs, does things
brew 'watchexec' # auto-restart process when file(s) change
brew 'wget'
brew 'yt-dlp' # audio/video downloader

# mkcert and nss are used to generate locally trusted development certificates
# needed for succesfully connecting locally via HTTPS
brew 'mkcert'
brew 'nss' # for Firefox

# yank: TUI for copying values (to clipboard) via keyboard navigation (arrow
# keys, hjkl, etc.)
#
# Ex: get a key or value from `env` & use '=' as a delimiter:
# env | yank -d =
#
# select a process and kill it:
# ps | yank -g '[0-9]+' | xargs kill
brew 'yank'

brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting' # syntax highlighting while typing

# fish-like abbreviations for zsh: aliases that expand when you hit enter
tap 'olets/tap'
brew 'zsh-abbr'

# find alternate (i.e. test) file
tap 'uptech/homebrew-oss'
brew 'uptech/oss/alt'

cask '1password-cli'
cask 'docker'
cask 'wezterm-nightly'

# share your keystrokes when creating screencasts, presenting, or collaborating with others
# ^⌥⌘K to toggle on/off
cask 'keycastr'

# Optionals. Uncomment to install
# cask 'lulu' # allow/deny apps network access
