brew 'automake'
brew 'bat' # cat replacement
brew 'choose-rust' # sed replacement. e.g.: `bat things.csv | choose 5`
brew 'cmake'
brew 'coreutils' # gnu coreutils
brew 'direnv' # directory-specific env vars
brew 'exa' # git-aware ls replacement
brew 'fd' # file finder
brew 'fzf' # fuzzy finder
brew 'gh' # GitHub CLI
brew 'git'
brew 'git-delta' # git-diff replacement
brew 'git-lfs' # handle Large Files in git
brew 'gpg'
brew 'grep' # gnu grep
brew 'httpie' # cURL replacement. e.g.: `http POST pie.dev/post hello=world`
brew 'imagemagick'
brew 'jq' # json processor
brew 'lazygit' # git TUI
brew 'lua'
brew 'luarocks' # lua package manager
brew 'neovim'
brew 'node'
brew 'nvm'
brew 'make' # gnu make
brew 'memcached'
brew 'parallel' # gnu parallel
brew 'python'
brew 'redis' # redis is redis
brew 'rg' # ripgrep
brew 'rust'
brew 'showkey' # type a key and see it echoed in the terminal
brew 'starship' # prompt
brew 'stylua' # lua code formatter
brew 'stow' # dotfiles management
brew 'tldr' # man page supplement. brief desc, then examples
brew 'tig'  # git history viewer
brew 'tmux'
brew 'toilet' # ascii banners :)
brew 'universal-ctags' # better ctags
brew 'watchexec' # auto-restart process when file(s) change
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting' # syntax highlighting while typing
brew 'zoxide' # smarter cd command

# fish-like abbreviations for zsh: aliases that expand when you hit enter
tap 'olets/tap'
brew 'zsh-abbr'

# find alternate (i.e. test) file
tap 'uptech/homebrew-oss'
brew 'uptech/oss/alt'

# Semantics-aware diffs using ASTs from tree-sitter
tap 'afnanenayet/tap'
brew 'diffsitter'

# fonts
tap 'homebrew/cask-fonts'
cask 'font-inconsolata'
cask 'font-fantasque-sans-mono'
cask 'font-powerline-symbols'

tap '1Password/homebrew-tap'
cask '1password-cli'

cask 'alacritty' # fast(est) terminal emulator

# Optionals. Uncomment to install

# cask 'lulu' # allow/deny apps network access
