brew 'automake'
brew 'bat' # cat replacement
brew 'chafa' # ANSI art renderer
brew 'choose-rust' # sed replacement. e.g.: `bat things.csv | choose 5`
brew 'cmake'
brew 'coreutils' # gnu coreutils
brew 'datasette' # simple web interface to SQLite databases
brew 'direnv' # directory-specific env vars
brew 'dua-cli' # display disk usage, & delete
brew 'esbuild'
brew 'exa' # git-aware ls replacement
brew 'fd' # file finder
brew 'fzf' # fuzzy finder
brew 'gh' # GitHub CLI
brew 'git'
brew 'git-delta' # git-diff replacement
brew 'git-lfs' # handle Large Files in git
brew 'gpg'
brew 'gping' # ping, but with graphs
brew 'grep' # gnu grep
brew 'httpie' # cURL replacement. e.g.: `http POST pie.dev/post hello=world`
brew 'imagemagick'
brew 'jq' # json processor
brew 'just' # command runner. `make` replacement.
brew 'lazygit' # git TUI
brew 'lua'
brew 'luarocks' # lua package manager
brew 'mas' # CLI for Mac App Store
brew 'neovim'
brew 'node'
brew 'nvm'
brew 'make' # gnu make
brew 'memcached'
brew 'overmind' # spawn Procfile under tmux
brew 'parallel' # gnu parallel
brew 'pastel' # generate/convert/manipulate colors
brew 'postgresql@14'
brew 'procs' # `ps` replacement written in Rust
brew 'python'
brew 'redis' # redis is redis
brew 'rg' # ripgrep
brew 'rust'
brew 'showkey' # type a key and see it echoed in the terminal
brew 'solargraph' # Ruby language server (LSP)
brew 'starship' # prompt
brew 'tealdeer' # Rust impl of `tldr`: man page supplement. brief desc, then examples
brew 'tig' # git history viewer
brew 'tmux'
brew 'toilet' # ascii banners :)
brew 'universal-ctags' # better ctags
brew 'watchman' # needed by Sorbet LSP
brew 'watchexec' # auto-restart process when file(s) change
brew 'wget'
brew 'yarn'

# yank: copy to clipboard via keyboard navigation (arrow keys, hjkl, etc.)
#
# get a key or value from `env` & use '=' as a delimiter:
# env | yank -d =
#
# select a process and kill it:
# ps | yank -g '[0-9]+' | xargs kill
brew 'yank'

brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting' # syntax highlighting while typing
brew 'zoxide' # smarter cd command

# fish-like abbreviations for zsh: aliases that expand when you hit enter
tap 'olets/tap'
brew 'zsh-abbr'

# find alternate (i.e. test) file
tap 'uptech/homebrew-oss'
brew 'uptech/oss/alt'

# To upgrade to a newer nightly version of wezterm (normal brew upgrade will not upgrade it!):
#
#   brew upgrade --cask wezterm-nightly --no-quarantine --greedy-latest
tap 'homebrew/cask-versions'
cask 'wezterm-nightly'

tap '1Password/homebrew-tap'
cask '1password-cli'

cask 'docker'
brew 'docker'

# Optionals. Uncomment to install
# cask 'lulu' # allow/deny apps network access
